import React from "react";
import Navbar from "../../Components/Navbar/Navbar";
import Footer from "../../Components/Footer/Footer";
import "./SingleArticle.css";

const SingleArticle = () => {
  return (
    <>
      <Navbar />
      <div className="article-container">
        <img
          src="../../../public/logo.jpeg" 
          alt="Article"
          className="article-image"
        />
        <h1 className="article-title">عنوان مقاله اول</h1>
        <p className="article-content">
        اینجا متن مقاله قرار می‌گیرد. شما می‌توانید هر متنی را که می‌خواهید به عنوان محتوای مقاله وارد کنید. 
        این متن می‌تواند شامل اطلاعات مختلفی باشد که شما می‌خواهید به خوانندگان خود ارائه دهید. 
        در این مقاله، ما به بررسی تأثیرات مثبت و منفی فناوری بر روی زندگی روزمره انسان‌ها خواهیم پرداخت. 
        فناوری به سرعت در حال پیشرفت است و این تغییرات بر روی شیوه‌های ارتباطی، کار و تفریح ما تأثیر گذاشته است.
      </p>
      <p className="article-content">
        یکی از بزرگ‌ترین مزایای فناوری، سهولت در ارتباطات است. امروزه، افراد می‌توانند به راحتی از طریق شبکه‌های اجتماعی، ایمیل و پیام‌رسان‌ها با یکدیگر ارتباط برقرار کنند. 
        این امر نه تنها باعث افزایش سرعت ارتباطات شده، بلکه امکان برقراری ارتباط با افراد در سراسر جهان را نیز فراهم کرده است.
      </p>
      <p className="article-content">
        با این حال، استفاده بیش از حد از فناوری می‌تواند منجر به انزوا و کاهش تعاملات اجتماعی واقعی شود. بسیاری از افراد ترجیح می‌دهند به جای ملاقات حضوری، از طریق فضای مجازی با یکدیگر در ارتباط باشند. 
        این موضوع می‌تواند تأثیرات منفی بر روی روابط انسانی و سلامت روانی افراد داشته باشد.
      </p>
      <p className="article-content">
        همچنین، فناوری در زمینه‌های مختلفی مانند آموزش و پرورش، پزشکی و تجارت نیز تغییرات عمده‌ای ایجاد کرده است. 
        .آموزش آنلاین به یک روش رایج تبدیل شد و بسیاری از دانش‌آموزان و دانشجویان مجبور شدند که از خانه‌های خود تحصیل کنند.
      </p>
      <p className="article-content">
        علاوه بر این، فناوری در صنعت پزشکی نیز انقلابی به وجود آورده است. پیشرفت‌های تکنولوژیکی در تشخیص بیماری‌ها و درمان آن‌ها باعث افزایش کیفیت زندگی و طول عمر انسان‌ها شده است.
        با این حال، چالش‌هایی نیز وجود دارد، از جمله نگرانی‌ها درباره حریم خصوصی و امنیت داده‌ها.
      </p>
      <p className="article-content">
        در نهایت، می‌توان گفت که فناوری همواره یک شمشیر دو لبه بوده است. از یک سو، مزایا و فرصت‌های بی‌شماری را برای ما فراهم کرده است، 
        اما از سوی دیگر، چالش‌ها و خطراتی نیز به همراه دارد. بنابراین، مهم است که با آگاهی و مسئولیت از فناوری استفاده کنیم تا بتوانیم از مزایای آن بهره‌مند شویم و آسیب‌های احتمالی را کاهش دهیم.
      </p>
      </div>

      <Footer />
    </>
  );
};

export default SingleArticle;
